/*
 * Логічні оператори (&& || !)
 */

//* && - запинається на брехні
//* Якщо операнд був преведенний до false, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до true, то повертається значення останнього операнду.
// const result = 10 && 'Hello' && 20 && '' && 'world!';

// console.log(result);

//* || - запинається на правді
//* Якщо операнд був преведенний до true, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до false, то повертається останній.

// const result = 0 || '' || 10 || null;

// console.log(result);

// const username = prompt('Введіть ваше імʼя') || 'anonymus';

// console.log(username);

//* ! - інвертує правду до брехні, а брехню до правди

// let isAdmin = 10;

// isAdmin = !isAdmin;

// console.log(isAdmin);
